Repository: brayns-it/shaper
Catalog: Translation/*.po
Languages: it_it

# Brayns.Shaper.Application
source: Root path '{0}' does not exists
it_it: Percorso radice '{0}' non esiste

# Brayns.Shaper.Application
source: Application is in maintenance, try again later
it_it: L'applicazione è in manutenzione, riprovare più tardi

# Brayns.Shaper.Client
source: No client connected
it_it: Nessun client connesso

# Brayns.Shaper.SessionTypes
source: System
it_it: Sistema

# Brayns.Shaper.SessionTypes
source: Web Client
it_it: Client web

# Brayns.Shaper.Session
source: Session interrupted
it_it: Sessione interrotta

# Brayns.Shaper.WebDispatcher
source: Unhandled type in raw web loop {0}
it_it: Tipo {0} non gestito nel loop raw

# Brayns.Shaper.Classes.Functions
source: {0} days
it_it: {0} giorni

# Brayns.Shaper.Classes.Functions
source: {0} hours
it_it: {0} ore

# Brayns.Shaper.Classes.Functions
source: {0} minutes
it_it: {0} minuti

# Brayns.Shaper.Classes.Functions
source: {0} seconds
it_it: {0} secondi

# Brayns.Shaper.Classes.Functions
source: Now
it_it: Ora

# Brayns.Shaper.Classes.Functions
source: Cannot increment {0}
it_it: Impossibile incrementare {0}

# Brayns.Shaper.Controls.Action
source: Run type must be derived from BasePage
it_it: Tipo avvio deve derivare da BasePage

# Brayns.Shaper.Controls.Grid
source: No data available
it_it: Nessun dato disponibile

# Brayns.Shaper.Controls.Notifications
source: No new notifications
it_it: Nessuna nuova notifica

# Brayns.Shaper.Database.Database
source: Prevent disruptive SQL {0}
it_it: Bloccato SQL distruttivo {0}

# Brayns.Shaper.Database.SQLite
source: Unknown field type '{0}'
it_it: Tipo campo {0} sconosciuto

# Brayns.Shaper.Database.SqlServer
source: Unknown field type '{0}'
it_it: Tipo campo {0} sconosciuto

# Brayns.Shaper.Fields.FieldTypes
source: Code
it_it: Codice

# Brayns.Shaper.Fields.FieldTypes
source: Integer
it_it: Intero

# Brayns.Shaper.Fields.FieldTypes
source: Option
it_it: Opzione

# Brayns.Shaper.Fields.FieldTypes
source: Text
it_it: Testo

# Brayns.Shaper.Fields.FieldTypes
source: Big Integer
it_it: Intero grande

# Brayns.Shaper.Fields.FieldTypes
source: Decimal
it_it: Decimale

# Brayns.Shaper.Fields.FieldTypes
source: Date
it_it: Data

# Brayns.Shaper.Fields.FieldTypes
source: DateTime
it_it: DataOra

# Brayns.Shaper.Fields.FieldTypes
source: Boolean
it_it: Booleano

# Brayns.Shaper.Fields.FieldTypes
source: Time
it_it: Ora

# Brayns.Shaper.Fields.BaseField
source: Field '{0}' does not belongs to table
it_it: Campo '{0}' non appartiene alla tabella

# Brayns.Shaper.Fields.BaseField
source: Field {0} is empty
it_it: Campo {0} è vuoto

# Brayns.Shaper.Fields.BaseField
source: Field {0} must be equal to {1}
it_it: Campo {0} deve essere uguale a {1}

# Brayns.Shaper.Fields.Boolean
source: Yes
it_it: Sì

# Brayns.Shaper.Fields.Boolean
source: {0} does not represent a valid boolean type
it_it: {0} non rappresenta un tipo booleano valido

# Brayns.Shaper.Fields.Option
source: {0} does not represent a valid {1} type
it_it: {0} non rappresenta un tipo {1} valido

# Brayns.Shaper.Fields.Text
source: Value of '{0}' cannot be longer than {1}
it_it: Il valore di '{0}' non può essere più lungo di {1}

# Brayns.Shaper.Loader.Proxy
source: Invalid raw route '{0}' '{1}'
it_it: {0} non valido rotta raw '{1}'

# Brayns.Shaper.Loader.Proxy
source: Invalid {0} route '{1}'
it_it: {0} non valido rotta '{1}'

# Brayns.Shaper.Loader.Proxy
source: Invalid object ID '{0}'
it_it: ID oggetto '{0}' non valido

# Brayns.Shaper.Loader.Proxy
source: Unauthorized access to unit '{0}'
it_it: Accesso non autorizzato a unit '{0}'

# Brayns.Shaper.Loader.Proxy
source: Unauthorized access to method '{0}'
it_it: Accesso non autorizzato al metodo '{0}'

# Brayns.Shaper.Loader.Proxy
source: Unknown method to invoke
it_it: Metodo sconosciuto da richiamare

# Brayns.Shaper.Loader.Proxy
source: Missing parameter '{0}' in method '{1}'
it_it: Parametro '{0}' mancante in metodo '{1}'

# Brayns.Shaper.Loader.Proxy
source: Invalid object name '{0}'
it_it: Nome oggetto '{0}' non valido

# Brayns.Shaper.Loader.Proxy
source: {0} invalid type
it_it: Tipo {0} non valido

# Brayns.Shaper.Loader.Proxy
source: Invalid method name '{0}'
it_it: Nome metodo '{0}' non valido

# Brayns.Shaper.Objects.RunningTask
source: {0} is not batchable
it_it: {0} non è schedulabile

# Brayns.Shaper.Objects.RunningTask
source: {0} is not a Batch method
it_it: {0} non è un metodo Batch

# Brayns.Shaper.Objects.BasePage
source: Data
it_it: Dati

# Brayns.Shaper.Objects.BasePage
source: New
it_it: Nuovo

# Brayns.Shaper.Objects.BasePage
source: Delete
it_it: Elimina

# Brayns.Shaper.Objects.BasePage
source: Refresh
it_it: Aggiorna

# Brayns.Shaper.Objects.BasePage
source: Delete {0}?
it_it: Eliminare {0}?

# Brayns.Shaper.Objects.BasePage
source: Delete selected {0} {1}?
it_it: Eliminare {0} {1} selezionati?

# Brayns.Shaper.Objects.BasePage
source: New {0}
it_it: Nuovo {0}

# Brayns.Shaper.Objects.BaseTable
source: Cannot modify primary key '{0}', use rename instead
it_it: Impossibile modificare la chiave primaria '{0}', utilizzare rinomina

# Brayns.Shaper.Objects.BaseTable
source: Table '{0}' has no primary key
it_it: Tabella '{0}' non ha chiave primaria

# Brayns.Shaper.Objects.BaseTable
source: Another user has modified table '{0}' try again
it_it: Un altro utente ha modificato la tabella '{0}' riprovare

# Brayns.Shaper.Objects.BaseTable
source: '{0}' not found
it_it: '{0}' non trovateo

# Brayns.Shaper.Objects.BaseTable
source: '{0}' not found: {1}
it_it: '{0}' non trovato: '{1}'

# Brayns.Shaper.Objects.Table
source: Table type must be '{0}'
it_it: Tipo tabella deve essere '{0}'

# Brayns.Shaper.Objects.TableRelation
source: Cannot relate to field '{0}' because it's not primary key member
it_it: Impossibile relazionare al campo '{0}' perché non è parte della chiave primaria

# Brayns.Shaper.Objects.TableRelation
source: Field '{0}' must be of the same type of '{1}'
it_it: Campo '{0}' deve essere dello stesso tipo di '{1}'

# Brayns.Shaper.Objects.TableRelation
source: Field '{0}' must be of the same size of '{1}'
it_it: Campo '{0}' deve essere della stessa dimensione di '{1}'

# Brayns.Shaper.Objects.TableRelation
source: Value {0} not found in related table {1}
it_it: Valore {0} non trovato nella tabella {0}

# Brayns.Shaper.Objects.TableRelation
source: Unsupported relation filter type {0} on {1}
it_it: Tipo filtro relazione {0} non supportato in {1}

# Brayns.Shaper.Objects.TableRelation
source: Field '{0}' does not belong to '{1}'
it_it: Campo '{0}' non appartiene a '{1}'

# Brayns.Shaper.Objects.UnitTypes
source: Table
it_it: Tabella

# Brayns.Shaper.Objects.UnitTypes
source: Page
it_it: Pagina

# Brayns.Shaper.Systems.Admin
source: Administration
it_it: Amministrazione

# Brayns.Shaper.Systems.Admin
source: Restart
it_it: Riavvia

# Brayns.Shaper.Systems.Admin
source: Compile
it_it: Compila

# Brayns.Shaper.Systems.Admin
source: Compile (force)
it_it: Compila (forzatamente)

# Brayns.Shaper.Systems.Admin
source: Verify
it_it: Verifica

# Brayns.Shaper.Systems.Admin
source: Language
it_it: Lingua

# Brayns.Shaper.Systems.Admin
source: Create PO templates
it_it: Crea modelli PO

# Brayns.Shaper.Systems.Admin
source: Creating POT {0}...
it_it: Creazione POT {0}...

# Brayns.Shaper.Systems.Admin
source: POT creation done.
it_it: Creazione POT completata.

# Brayns.Shaper.Systems.Admin
source: No log.
it_it: Nessun log.

# Brayns.Shaper.Systems.Admin
source: Compiling database (with force)...
it_it: Compilazione database (forzata)...

# Brayns.Shaper.Systems.Admin
source: Compiling done.
it_it: Compilazione completata.

# Brayns.Shaper.Systems.Admin
source: Verifying database...
it_it: Verifica database...

# Brayns.Shaper.Systems.Admin
source: Verifying done with disruptions: proceed manually.
it_it: Verifica completata con distruzioni: procedere manualmente.

# Brayns.Shaper.Systems.Admin
source: Verifying done, no database disruptions.
it_it: Verifica completata, nessuna distruzione database.

# Brayns.Shaper.Systems.Admin
source: Compiling database...
it_it: Compilazione database...

# Brayns.Shaper.Systems.Confirm
source: Confirm
it_it: Conferma

# Brayns.Shaper.Systems.Confirm
source: Yes
it_it: Sì

# Brayns.Shaper.Systems.Message
source: Message
it_it: Messaggio

# Brayns.Shaper.Systems.Progress
source: Progress
it_it: Avanzamento

# Brayns.Shaper.Systems.Progress
source: Cancel
it_it: Annulla

# Brayns.Shaper.Systems.Setup
source: Database type
it_it: Tipo database

# Brayns.Shaper.Systems.Setup
source: Database connection
it_it: Connessione database

# Brayns.Shaper.Systems.Setup
source: Database login
it_it: Login database

# Brayns.Shaper.Systems.Setup
source: Database password
it_it: Password database

# Brayns.Shaper.Systems.Setup
source: Database name
it_it: Nome database

# Brayns.Shaper.Systems.Setup
source: Database server
it_it: Server database

# Brayns.Shaper.Systems.Setup
source: Environment name
it_it: Nome ambiente

# Brayns.Shaper.Systems.Setup
source: Maintenance network
it_it: Network manutenzione

# Brayns.Shaper.Systems.Setup
source: General
it_it: Generale

# Brayns.Shaper.Systems.Setup
source: Save
it_it: Salva

# Brayns.Shaper.Systems.Setup
source: New Shaper
it_it: Nuovo Shaper
